using System.Collections;
using System.Collections.Generic;
using UnityEngine;

static public class quizData
{
    // quizDataTable の要素数
    public static readonly int quizDataTBLNum = 384;
    // quizDataTable 問題の要素番号
    public static readonly int quizDataTBLPara = 0;
    // quizDataTable こたえの要素番号
    public static readonly int quizDataTBLAns1Para = 1;
    public static readonly int quizDataTBLAns2Para = 2;
    public static readonly int quizDataTBLAns3Para = 3;
    public static readonly int quizDataTBLAns4Para = 3;
    // quizDataBuff の要素数
    public static readonly int quizDataBufNum = 10;

    //static変数
    //取得quizデータ
    public static string[,] quizDataBuf = new string[quizDataBufNum, 5];
	//現在quizData
	public static int quizDataNowPos = 0;
	// quiz選択のスタック
	static int[] StackChosenQuiz = new int[quizDataBufNum];

	//定数
	// quizDataTable
	public static readonly string[,] quizDataTable =
	{
		//	問題				答え1				答え2				答え3				答え4			
		{"相沢忠弘が岩宿遺跡を発見","1","9","4","6"},
		{"エドワード・モースが大森貝塚を発見","1","8","7","7"},
		{"倭の奴国が後漢の光武帝より印綬を賜る","0","0","5","7"},
		{"卑弥呼が魏に使いを送り、親魏倭王の号を賜る","0","2","3","9"},
		{"有坂鉊蔵らが弥生土器を発見","1","8","8","4"},
		{"筑紫国造磐井の反乱","0","5","2","7"},
		{"伽耶(加羅・任那)が新羅に滅ぼされる","0","5","6","2"},
		{"蘇我馬子が物部守屋を殺害","0","5","8","7"},
		{"隋建国","0","5","8","9"},
		{"蘇我馬子が崇峻天皇を殺害","0","5","9","2"},
		{"推古天皇が即位","0","5","9","2"},
		{"聖徳太子、推古天皇の摂政に就任","0","5","9","3"},
		{"冠位１２階の制定","0","6","0","3"},
		{"１７条の憲法制定","0","6","0","4"},
		{"遣隋使派遣（小野妹子）法隆寺を建立","0","6","0","7"},
		{"唐建国","0","6","1","8"},
		{"遣唐使を派遣（犬上御田鍬ら）","0","6","3","0"},
		{"大化の改新","0","6","4","5"},
		{"白村江の戦い","0","6","6","3"},
		{"大津京遷都","0","6","6","7"},
		{"天智天皇の即位","0","6","6","8"},
		{"壬申の乱","0","6","7","2"},
		{"大海人皇子→天武天皇即位","0","6","7","3"},
		{"富文銭の鋳造（天武天皇）","0","6","8","3"},
		{"八色の姓の制定（天武天皇）","0","6","8","4"},
		{"藤原京遷都（持統天皇）","0","6","9","4"},
		{"大宝律令制定（文武天皇）","0","7","0","1"},
		{"和同開珎の鋳造（元明天皇）","0","7","0","8"},
		{"平城京遷都（元明天皇）","0","7","1","0"},
		{"古事記編纂（元明天皇）","0","7","1","2"},
		{"風土記編纂を命じる（元明天皇）","0","7","1","3"},
		{"養老律令編纂（元正天皇）","0","7","1","8"},
		{"日本書紀編纂（元正天皇）","0","7","2","0"},
		{"三世一身の法制定（元正天皇）","0","7","2","3"},
		{"国分寺・国分尼寺建立の詔(聖武天皇)","0","7","4","1"},
		{"墾田永年私財法の制定（聖武天皇）","0","7","4","3"},
		{"大仏造立の詔（聖武天皇）","0","7","4","3"},
		{"鑑真来日、律宗を伝える","0","7","5","4"},
		{"聖武上皇死去、遺品を東大寺に納める（正倉院）","0","7","5","6"},
		{"長岡京遷都（桓武天皇）","0","7","8","4"},
		{"平安京遷都（桓武天皇）","0","7","9","4"},
		{"坂上田村麻呂、征夷大将軍に就任","0","7","9","7"},
		{"胆沢城築城","0","8","0","2"},
		{"アテルイ降伏","0","8","0","2"},
		{"最澄・空海が唐に渡る","0","8","0","4"},
		{"最澄帰国（天台宗をはじめる）","0","8","0","5"},
		{"空海帰国（真言宗をはじめる）","0","8","0","6"},
		{"藤原良房　摂政就任","0","8","5","8"},
		{"藤原基経　関白就任","0","8","8","4"},
		{"菅原道真  遣唐使の中止を進言（宇多天皇）","0","8","9","4"},
		{"菅原道真、大宰府に左遷","0","9","0","1"},
		{"古今和歌集編纂（紀貫之・醍醐天皇）","0","9","0","5"},
		{"平将門の乱（承平・天慶の乱）","0","9","3","5"},
		{"藤原純友の乱（承平・天慶の乱）","0","9","3","9"},
		{"宋建国","0","9","6","0"},
		{"尾張国の国司の藤原元命が郡司・百姓らに訴えられる","0","9","8","8"},
		{"藤原道長、摂政就任","1","0","1","6"},
		{"藤原頼通、摂政就任","1","0","1","7"},
		{"前九年の役","1","0","5","1"},
		{"荘園整理令（後三条天皇）","1","0","6","9"},
		{"後三年の役","1","0","8","3"},
		{"白河上皇  院政をはじめる","1","0","8","6"},
		{"藤原清衡　中尊寺金色堂建立 ","1","1","2","4"},
		{"保元の乱","1","1","5","6"},
		{"平治の乱","1","1","5","9"},
		{"太政大臣に就任","1","1","6","7"},
		{"源頼朝の挙兵","1","1","8","0"},
		{"石橋山の戦い","1","1","8","0"},
		{"富士川の戦い","1","1","8","0"},
		{"平清盛死去","1","1","8","1"},
		{"倶利伽羅峠の戦い","1","1","8","3"},
		{"一ノ谷の戦い","1","1","8","4"},
		{"屋島の戦い・壇ノ浦の戦い（平氏滅亡）","1","1","8","5"},
		{"頼朝、全国に守護・地頭を設置","1","1","8","5"},
		{"源頼朝、征夷大将軍に就任","1","1","9","2"},
		{"源実朝  将軍就任","1","2","0","3"},
		{"北条時政  政執権就任","1","2","0","3"},
		{"新古今和歌集編纂","1","2","0","5"},
		{"チンギスハン モンゴル帝国建国","1","2","0","6"},
		{"承久の乱(北条義時・政子)","1","2","2","1"},
		{"御成敗式目（貞永式目）制定","1","2","3","2"},
		{"フビライハン　元建国","1","2","7","1"},
		{"文永の役（時宗）","1","2","7","4"},
		{"弘安の役（時宗）","1","2","8","1"},
		{"永仁の徳政令","1","2","9","7"},
		{"後醍醐天皇即位","1","3","1","8"},
		{"正中の変","1","3","2","4"},
		{"元弘の変","1","3","3","1"},
		{"鎌倉幕府滅亡","1","3","3","3"},
		{"建武の新政","1","3","3","4"},
		{"建武式目制定","1","3","3","6"},
		{"南北朝時代へ","1","3","3","6"},
		{"足利尊氏　征夷大将軍に就任","1","3","3","8"},
		{"天竜寺船を作る","1","3","4","1"},
		{"天竜寺船を元に派遣","1","3","4","2"},
		{"足利義満、征夷大将軍に就任","1","3","6","8"},
		{"明建国（朱元璋（太祖・洪武帝））","1","3","6","8"},
		{"足利義満花の御所を造営　室町へ移る","1","3","7","8"},
		{"足利義満　南北朝合一","1","3","9","2"},
		{"李氏朝鮮建国","1","3","9","2"},
		{"足利義満（鹿苑寺）金閣造営","1","3","9","7"},
		{"勘合貿易開始","1","4","0","4"},
		{"正長の土一揆","1","4","2","8"},
		{"琉球王朝成立","1","4","2","9"},
		{"応仁の乱がはじまる（～1477）","1","4","6","7"},
		{"山城の国一揆","1","4","8","5"},
		{"加賀の一向一揆","1","4","8","8"},
		{"足利義政（慈照寺）銀閣造営","1","4","8","9"},
		{"鉄砲伝来","1","5","4","3"},
		{"キリスト教伝来","1","5","4","9"},
		{"川中島の戦い","1","5","5","3"},
		{"桶狭間の戦い（今川義元を破る）","1","5","6","0"},
		{"足利義昭を奉じて入京","1","5","6","8"},
		{"石山合戦がはじまる（～1580）","1","5","7","0"},
		{"比叡山焼打ち","1","5","7","1"},
		{"義昭追放→室町幕府の滅亡","1","5","7","3"},
		{"長篠の戦い(家康と組み武田勝頼を破る)","1","5","7","5"},
		{"安土城築城（翌年　安土で楽市）","1","5","7","6"},
		{"石山合戦が終わる（蓮如と和解）","1","5","8","0"},
		{"天正少年遣欧使節が長崎を出航","1","5","8","2"},
		{"本能寺の変","1","5","8","2"},
		{"山崎の戦い（明智光秀を破る）","1","5","8","2"},
		{"太閤検地","1","5","8","2"},
		{"賤ヶ岳の戦い（柴田勝家を破る）","1","5","8","3"},
		{"大阪城築城（石山本願寺跡）","1","5","8","3"},
		{"小牧・長久手の戦い","1","5","8","4"},
		{"関白就任","1","5","8","5"},
		{"四国平定（長宗我部元親を破る）","1","5","8","5"},
		{"太政大臣就任（豊臣姓を賜る）","1","5","8","6"},
		{"九州平定（島津義久を破る）","1","5","8","7"},
		{"バテレン追放令を出す","1","5","8","7"},
		{"刀狩令を出す","1","5","8","8"},
		{"文禄の役","1","5","9","2"},
		{"伏見城を築城","1","5","9","4"},
		{"慶長の役","1","5","9","7"},
		{"豊臣秀吉死去","1","5","9","8"},
		{"リーフデ号豊後に漂着","1","6","0","0"},
		{"関が原の戦い","1","6","0","0"},
		{"徳川家康 征夷大将軍に就任","1","6","0","3"},
		{"徳川秀忠 征夷大将軍に就任","1","6","0","5"},
		{"キリスト教禁教令（直轄領）","1","6","1","2"},
		{"キリスト教禁教令（全国）","1","6","1","3"},
		{"方広寺鐘銘事件","1","6","1","4"},
		{"大阪　冬の陣","1","6","1","4"},
		{"大阪　夏の陣","1","6","1","5"},
		{"武家諸法度制定・禁中並公家諸法度制定","1","6","1","5"},
		{"徳川家康　死去","1","6","1","6"},
		{"スペイン船来航禁止","1","6","2","4"},
		{"奉書船以外の日本船の海外渡航禁止・在外５年以上の日本人帰国禁止","1","6","3","3"},
		{"日本人の海外渡航・帰国禁止","1","6","3","5"},
		{"武家諸法度制定（参勤交代制度化）","1","6","3","5"},
		{"島原の乱","1","6","3","7"},
		{"ポルトガル船来航禁止","1","6","3","9"},
		{"オランダ商館を出島に移す","1","6","4","1"},
		{"清建国","1","6","3","6"},
		{"慶安の御触書","1","6","4","9"},
		{"由井正雪の乱（慶安の変）","1","6","5","1"},
		{"明暦の大火","1","6","5","7"},
		{"シャクシャインの戦い","1","6","6","9"},
		{"生類憐みの令（１回目）","1","6","8","5"},
		{"湯島聖堂が作られる","1","6","9","0"},
		{"正徳の治がはじまる（新井白石）　　生類憐みの令廃止","1","7","0","9"},
		{"享保の改革（吉宗、八代将軍就任）","1","7","1","6"},
		{"漢訳洋書の輸入を緩和","1","7","2","0"},
		{"目安箱の設置","1","7","2","1"},
		{"上げ米の制","1","7","2","2"},
		{"足高の制（大岡忠相ら登用）","1","7","2","3"},
		{"享保の大飢饉","1","7","3","2"},
		{"蕃薯考（ばんしょこう）を発表（青木昆陽）","1","7","3","5"},
		{"公事方御定書","1","7","4","2"},
		{"田沼意次、老中就任","1","7","7","2"},
		{"「解体新書」刊行","1","7","7","4"},
		{"天明の大飢饉","1","7","8","2"},
		{"浅間山の大噴火","1","7","8","3"},
		{"寛政の改革（松平定信、老中就任）","1","7","8","7"},
		{"寛政異学の禁","1","7","9","0"},
		{"「海国兵談」絶版（林子平）","1","7","9","2"},
		{"ラックスマン、根室に来航（ロシア）","1","7","9","2"},
		{"「古事記伝」を著す（ 本居宣長）","1","7","9","8"},
		{"レザノフ、長崎に来航（ロシア）","1","8","0","4"},
		{"間宮林蔵、樺太探検","1","8","0","8"},
		{"フェートン号事件","1","8","0","8"},
		{"「大日本沿海輿地全図」作成","1","8","2","1"},
		{"異国船打払令（無二念打払令）","1","8","2","5"},
		{"シーボルト事件","1","8","2","8"},
		{"天保の大飢饉","1","8","3","3"},
		{"大塩平八郎の乱","1","8","3","7"},
		{"モリソン号事件","1","8","3","7"},
		{"蛮社の獄","1","8","3","9"},
		{"アヘン戦争","1","8","4","0"},
		{"天保の改革（水野忠邦）","1","8","4","1"},
		{"天保の薪水給与令","1","8","4","2"},
		{"人返し令・上知令","1","8","4","3"},
		{"オランダ国王の開国勧告","1","8","4","4"},
		{"ペリー来港","1","8","5","3"},
		{"日米和親条約","1","8","5","4"},
		{"タウンゼント・ハリス　日本領事着任","1","8","5","6"},
		{"日米修好通商条約","1","8","5","8"},
		{"安政の大獄がはじまる","1","8","5","8"},
		{"桜田門外の変","1","8","6","0"},
		{"坂下門外の変","1","8","6","2"},
		{"生麦事件","1","8","6","2"},
		{"下関事件","1","8","6","3"},
		{"薩英戦争","1","8","6","3"},
		{"第一次長州征討","1","8","6","4"},
		{"四国連合艦隊下関砲撃事件","1","8","6","4"},
		{"薩長同盟","1","8","6","6"},
		{"大政奉還","1","8","6","7"},
		{"王政復古の大号令","1","8","6","7"},
		{"戊辰戦争がはじまる（鳥羽伏見の戦い）","1","8","6","8"},
		{"五箇条のご誓文・五傍の掲示","1","8","6","8"},
		{"東京遷都","1","8","6","9"},
		{"戊辰戦争が終わる（五稜郭の戦い）","1","8","6","9"},
		{"版籍奉還","1","8","6","9"},
		{"郵便制度がはじまる","1","8","7","1"},
		{"廃藩置県","1","8","7","1"},
		{"日清修好条規調印","1","8","7","1"},
		{"岩倉具視ら海外渡航","1","8","7","1"},
		{"琉球藩設置","1","8","7","2"},
		{"「学問のすすめ」福沢諭吉","1","8","7","2"},
		{"学制発布","1","8","7","2"},
		{"鉄道開通（新橋・横浜）","1","8","7","2"},
		{"富岡製糸場操業開始","1","8","7","2"},
		{"徴兵令（←血税一揆）","1","8","7","3"},
		{"キリスト教解禁","1","8","7","3"},
		{"地租改正条例公布","1","8","7","3"},
		{"明治六年の政変（征韓派)下野","1","8","7","3"},
		{"民撰議院設立建白書提出（板垣退助・江藤新平ら）","1","8","7","4"},
		{"佐賀の乱（江藤新平）→神風連の乱・秋月の乱・萩の乱(1876)","1","8","7","4"},
		{"各地で地租改正反対一揆が起こる","1","8","7","4"},
		{"立志社設立（板垣退助ら）","1","8","7","4"},
		{"愛国社設立（板垣退助ら）","1","8","7","5"},
		{"樺太・千島交換条約締結","1","8","7","5"},
		{"江華島事件","1","8","7","5"},
		{"新聞紙条例・讒謗律制定","1","8","7","5"},
		{"廃刀令","1","8","7","6"},
		{"日朝修好条規（江華条約）調印","1","8","7","6"},
		{"地租税率改正（３％→２．５％）","1","8","7","7"},
		{"西南戦争","1","8","7","7"},
		{"沖縄県設置","1","8","7","9"},
		{"国会期成同盟結成","1","8","8","0"},
		{"集会条例公布","1","8","8","0"},
		{"北海道開拓使官有物払い下げ事件","1","8","8","1"},
		{"国会開設の詔","1","8","8","1"},
		{"板垣退助、自由党結成","1","8","8","1"},
		{"大隈重信、立憲改進党結成","1","8","8","2"},
		{"伊藤博文、憲法調査のため渡航","1","8","8","2"},
		{"鹿鳴館完成","1","8","8","3"},
		{"秩父事件(秩父困民党）","1","8","8","4"},
		{"内閣制度創設（初代内閣総理大臣　伊藤博文）","1","8","8","5"},
		{"ノルマントン号事件","1","8","8","6"},
		{"大同団結運動","1","8","8","6"},
		{"三大事件建白運動","1","8","8","7"},
		{"保安条例公布","1","8","8","7"},
		{"枢密院設置","1","8","8","8"},
		{"大日本帝国憲法発布","1","8","8","9"},
		{"教育勅語発布","1","8","9","0"},
		{"第一衆議院議員選挙実施","1","8","9","0"},
		{"第一回帝国議会が開かれる","1","8","9","0"},
		{"大津事件","1","8","9","1"},
		{"足尾銅山鉱毒事件が問題となる","1","8","9","1"},
		{"日英通商航海条約締結　（治外法権撤廃）","1","8","9","4"},
		{"甲午農民戦争（東学党の乱：朝鮮）","1","8","9","4"},
		{"日清戦争","1","8","9","4"},
		{"下関条約締結","1","8","9","5"},
		{"三国干渉","1","8","9","5"},
		{"隈板内閣成立","1","8","9","8"},
		{"北清事変（義和団事件）","1","9","0","0"},
		{"八幡製鉄所操業開始","1","9","0","1"},
		{"日英同盟締結","1","9","0","2"},
		{"日露戦争","1","9","0","4"},
		{"ポーツマス条約締結","1","9","0","5"},
		{"伊藤博文・安重根に殺害される","1","9","0","9"},
		{"大逆事件（幸徳秋水ら捕らえられる）","1","9","1","0"},
		{"韓国併合（朝鮮総督府設置）","1","9","1","0"},
		{"日米通商航海条約締結（関税自主権回復）","1","9","1","1"},
		{"辛亥革命（孫文）","1","9","1","1"},
		{"中華民国建国","1","9","1","2"},
		{"大正時代の始まり","1","9","1","2"},
		{"第一次護憲運動","1","9","1","2"},
		{"第一次世界大戦が始まる","1","9","1","4"},
		{"対華２１ヶ条の要求 ","1","9","1","5"},
		{"吉野作造 「民本主義」を唱える","1","9","1","6"},
		{"ロシア革命が起こる","1","9","1","7"},
		{"シベリア出兵","1","9","1","8"},
		{"米騒動","1","9","1","8"},
		{"原敬内閣 成立","1","9","1","8"},
		{"第一次世界大戦が終わる","1","9","1","8"},
		{"パリ講和会議の開催","1","9","1","9"},
		{"３・１運動（朝鮮）","1","9","1","9"},
		{"５・４運動（中国）","1","9","1","9"},
		{"ベルサイユ条約締結","1","9","1","9"},
		{"国際連盟成立","1","9","2","0"},
		{"ワシントン会議が開かれる","1","9","2","1"},
		{"全国水平者創立","1","9","2","2"},
		{"ソビエト社会主義共和国連邦成立","1","9","2","2"},
		{"関東大震災","1","9","2","3"},
		{"第二次護憲運動","1","9","2","4"},
		{"ラジオ放送が始まる","1","9","2","5"},
		{"治安維持法制定","1","9","2","5"},
		{"普通選挙法制定","1","9","2","5"},
		{"大正時代の終わり","1","9","2","6"},
		{"世界恐慌","1","9","2","9"},
		{"ロンドン会議","1","9","3","0"},
		{"柳条湖事件（満州事変）","1","9","3","1"},
		{"満州国建国宣言","1","9","3","2"},
		{"リットン調査団調査","1","9","3","2"},
		{"５・１５事件","1","9","3","2"},
		{"国際連盟脱退","1","9","3","3"},
		{"２・２６事件","1","9","3","6"},
		{"日中戦争が始まる（盧溝橋事件）","1","9","3","7"},
		{"国家総動員法","1","9","3","8"},
		{"第二次世界大戦が始まる","1","9","3","9"},
		{"日独伊三国同盟","1","9","4","0"},
		{"大政翼賛会","1","9","4","0"},
		{"日ソ中立条約","1","9","4","1"},
		{"太平洋戦争が始まる","1","9","4","1"},
		{"ヤルタ会談（米・英・ソ）","1","9","4","5"},
		{"ポツダム宣言受託","1","9","4","5"},
		{"ＧＨＱ設置（マッカーサー）国際連合発足","1","9","4","5"},
		{"天皇人間宣言","1","9","4","6"},
		{"教育基本法・学校教育法・労働基準法・独占禁止法","1","9","4","7"},
		{"朝鮮が分裂（朝鮮民主主義人民共和国・大韓民国）","1","9","4","8"},
		{"中華人民共和国が成立","1","9","4","9"},
		{"朝鮮戦争が始まる","1","9","5","0"},
		{"警察予備隊設置","1","9","5","0"},
		{"ワシントン平和条約調印","1","9","5","1"},
		{"日米安全保障条約調印","1","9","5","1"},
		{"保安隊設置","1","9","5","2"},
		{"朝鮮戦争が休戦","1","9","5","3"},
		{"テレビ放送が始まる","1","9","5","3"},
		{"第五福竜丸、ビキニ水爆実験で被爆","1","9","5","4"},
		{"自衛隊発足","1","9","5","4"},
		{"バンドン会議","1","9","5","5"},
		{"日ソ共同宣言","1","9","5","6"},
		{"･日米新安全保障条約・地位協定調印･安保闘争が起こる","1","9","6","0"},
		{"東海道新幹線が開通","1","9","6","4"},
		{"日韓基本条約調印","1","9","6","5"},
		{"小笠原諸島が返還される","1","9","6","8"},
		{"日中共同声明調印","1","9","7","2"},
		{"沖縄が返還される","1","9","7","2"},
		{"第一次石油危機（第四次中東戦争）","1","9","7","3"},
		{"ロッキード事件","1","9","7","6"},
		{"日中平和友好条約調印","1","9","7","8"},
		{"平成がはじまる","1","9","8","9"},
		{"消費税実施","1","9","8","9"},
		{"湾岸戦争が起こる","1","9","9","1"},
		{"ＰＫＯ法成立","1","9","9","2"},
		{"５５年体制が終わる","1","9","9","3"},
		{"阪神淡路大震災/地下鉄ｻﾘﾝ事件","1","9","9","5"},
		{"沖縄サミット開催","2","0","0","0"},
		{"アメリカ同時多発テロ事件","2","0","0","1"},
		{"ピョンヤン宣言","2","0","0","2"},
		{"米英、イラク攻撃","2","0","0","3"},
		{"自衛隊、イラクへ派遣","2","0","0","4"},
		{"オバマ第44代米合衆国大統領に就任","2","0","0","9"},
		{"ドイツが東西に分裂","1","9","4","9"},
		{"ＮＡＴＯ（北大西洋条約機構）が成立","1","9","4","9"},
		{"ワルシャワ条約機構が成立","1","9","5","5"},
		{"ペレストロイカが始まる","1","9","8","5"},
		{"米ソ中距離核戦力(INF)全廃条約","1","9","8","7"},
		{"ベルリンの壁崩壊","1","9","8","9"},
		{"マルタ会談米ソ「冷戦終結宣言」","1","9","8","9"},
		{"東西ドイツの統一","1","9","9","0"},
		{"ソ連崩壊","1","9","9","1"},
		{"ワルシャワ条約機構消滅","1","9","9","1"},
		{"キューバ危機","1","9","6","2"},
		{"ケネディ大統領暗殺","1","9","6","3"},
		{"ベトナム戦争が始まる","1","9","6","5"},
		{"ベトナム戦争が終わる","1","9","7","5"},
		{"イラクのクウェート侵攻","1","9","9","0"},
		{"湾岸戦争が始まる","1","9","9","1"},
		{"マンデラ 氏・デクラーク大統領とノーベル平和賞を受賞。","1","9","9","3"},
		{"ＥＣＣの成立","1","9","5","8"},
		{"ＥＣの成立","1","9","6","7"},
		{"ＥＵの成立","1","9","9","3"},
		{"ＥＵＲＯ通貨の使用開始","2","0","0","2"},
		{"水俣病が認定される","1","9","5","6"},
		{"公害対策基本法制定","1","9","6","7"},
		{"環境庁設置","1","9","9","3"},
		{"中央省庁再編により環境庁を改組し、環境省が設置される","2","0","0","1"},
		{"国際連合人間環境会議で「人間環境宣言」が採択される。","1","9","7","2"},
		{"国連環境開発会議（地球サミット）で「リオ」宣言が採択される。","1","9","9","2"},
		{"京都議定書が議決される。","1","9","9","7"}
	};

	//現在quizData取得
	public static int GetquizDataNowPos()
	{
		return quizDataNowPos;
	}

	//現在quizDataインクリメント処理
	public static void NextquizDataNowPos()
	{
		quizDataNowPos++;

		if (quizDataNowPos >= quizDataBufNum)
		{
			quizDataNowPos = quizDataBufNum - 1;
		}
	}

	//現在quizDataクリア処理
	public static void ClearquizDataNowPos()
	{
		quizDataNowPos = 0;
	}

	//quizData初期化
	public static void quizDataInit()
	{
		int iLoop, jLoop;   //Loop変数

		//取得quizデータNull埋め
		for (iLoop = 0; iLoop < quizDataBufNum; iLoop++)
		{
			for (jLoop = 0; jLoop < 4; jLoop++)
			{
				quizDataBuf[iLoop, jLoop] = "";
			}
		}
		//現在quizData　0初期化
		quizDataNowPos = 0;

		//取得quizデータNull埋め
		for (iLoop = 0; iLoop<quizDataBufNum ; iLoop++)
		{
			// quiz選択のスタック -1埋め
			StackChosenQuiz[iLoop] = -1;
		}
	}

	//quizData作成
	public static void quizDataMake()
    {
		int RandomDataQuiz;     //設定用の乱数設定データ
		int i;					//Loop変数

		//スタックに重複なくデータquiz番号を入れる
		while (-1 == StackChosenQuiz[quizData.quizDataBufNum - 1])
		{
			//乱数を取得 0～クイズ全体数
			RandomDataQuiz = Random.Range(0, quizData.quizDataTBLNum);
			//重複チェック
			for (i = 0; i < quizDataBufNum; i++)
			{
				if (StackChosenQuiz[i] == -1)
				{
					//未設定データ
					StackChosenQuiz[i] = RandomDataQuiz;
					//ついでにquizDataBufのデータも設定してみる
					quizDataBuf[i, 0] = quizDataTable[RandomDataQuiz, 0];  //問題
					quizDataBuf[i, 1] = quizDataTable[RandomDataQuiz, 1];  //答え1
					quizDataBuf[i, 2] = quizDataTable[RandomDataQuiz, 2];  //答え2
					quizDataBuf[i, 3] = quizDataTable[RandomDataQuiz, 3];  //答え3
					quizDataBuf[i, 4] = quizDataTable[RandomDataQuiz, 4];  //答え4
					break;
				}
				else if (StackChosenQuiz[i] == RandomDataQuiz)
				{
					//被っているので取得し直し
					break;
				}
			}
		}
	}

	//QuizDataの取得
	//Factor
	//0:QuizText 1:答え1 2:答え2 3:答え3 4:答え4
	public static string GetquizDataBuf(int Factor)
    {
		string retStr;

		if(Factor > 4)
        {
			retStr = "-1";
		}
        else
        {
			retStr = quizDataBuf[quizDataNowPos, Factor];

		}

		return retStr;
	}

}
